Revit 2027 API
FabricationNetworkChangeService.SetRestrictPalette Method
 Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRestrictPalette(
	bool restrictPalette
)
Public Sub SetRestrictPalette (
	restrictPalette As Boolean
)
public:
void SetRestrictPalette(
	bool restrictPalette
)
member SetRestrictPalette :
        restrictPalette : bool -> unit
Parameters
restrictPalette Boolean
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace